Repository: crtarsorg/data-centar
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: sr

source: Search
sr: Pretraga

source: About
sr: O nama

source: WHICH DATASET SHOULD WE OPEN NEXT?
sr: Koji sledeći skup podataka da oslobodimo?

source: Choose a dataset
sr: Izaberite skup podataka

source: Asset declarations
sr: Prijava imovine

source: More municipal budgets
sr: Još opštinskih budžeta

source: Public procurements
sr: Javne nabavke

source: Business association registries
sr: Registar privrednih subjekata

source: Other, specified in comment
sr: Drugo, pojašnjeno u komentaru

source: How would you use this information?
sr: Kako biste koristili ove informacije?

source: Send
sr: Pošaljite

source: Contact us
sr: Kontaktirajte nas

source: Write to us</b></a> if you need any special information, data, or visualizations.
sr: Pišite nam ukoliko vam je potrebna bilo kakva posebna infromacija, podatak ili vizuelizacija.

source: Data Centar is freely available to all under a Creative Commons CC-0 license.
sr: Data Centar je dostupan svima pod uslovima licence Creative Commons CC-0.

source: Thank you
sr: Hvala vam!

source: Thank you!
sr: Hvala vam!

source: Your vote will help us decide which dataset to liberate next.
sr: Vaš glas će nam pomoći da odlučimo koji sledeći skup podataka da oslobodimo.

source: If you want to keep in touch, follow us on
sr: Ukoliko želite da ostanemo u kontaktu, pratite nas na

source: and
sr: i

source: Tell us what to liberate next
sr: Recite nam šta sledeće da oslobodimo

source: Advanced search
sr: Napredna pretraga

source: Data Centar is an open online platform that provides easy access to datasets of various public information at the national and local level in Serbia. It was developed to help journalists, activists, researchers and public officials in search for valuable data to power their stories, campaigns, analyses or decision making. With the use of latest technologies, Data Centar simplifies, integrates and prepares complex, disparate and disorganized datasets for easy and meaningful use by all interested stakeholders. By making good use of public data, Data Centar and its users push for governments to offer useful and good quality data and provide the public what they need to participate in decision making as active and informed citizens.
sr: Data Centar je otvorena, onlajn platforma, koja omogućava lak pristup skupovima podataka o različitim javnim informacijama u Srbiji, na državnom i lokalnom nivou. Razvijen je sa ciljem da pomogne novinarima, aktivistima, istraživačima i javnim funkcionerima u potrazi za vrednim podacima koji bi potkrepili njihove priče, kampanje, analize i proces donošenja odluka. Uz pomoć najnovijih tehnologija, Data Centar pojednostavljuje, integriše i priprema složene, različite i neorganizovane skupove podataka za jednostavnu i suvislu upotrebu svih zainteresovanih strana. Dobrim korišćenjem javnih podataka Data Centar i njegovi korisnici vrše pritisak na vlast da ponudi korisne i kvalitetne podatke i pruži javnosti ono što joj je potrebno da učestvuje u procesu donošenja odluka kao aktivni i informisani građani.

source: Ways to Use the Site
sr: Načini za korišćenje sajta

source: You can start exploring right from the homepage: click on the pre-made search right below the video, or click on “show me another” to get a new pre-made search
sr: Istraživanje možete početi odmah na naslovnoj strani: kliknite na polje za pretragu odmah ispod videa ili kliknite na "prikažite drugo" kako biste pokrenuli novu pretragu

source: On the
sr: Na

source: page, you can visualize all our data and filter it by any variable (like geographic location, amount, or anything else)
sr: pretraga, možete da vizuelizujete sve naše podatke i filtrirate ih po bilo kojoj promenljivoj (kao što su geografski položaj, iznos ili nešto drugo)

source: The visualization are automatically updated, to give you an easier overview of what the data is saying
sr: Vizuelizacije se automatski ažuriraju kako bi vam omogućile jednostavniji pregled o tome šta podaci govore

source: We are working on custom advanced searches, where you will be able to define <b>operators</b> like “less than”, “is true”, “is empty” etc to create complex filtering directly on the website
sr: Radimo na posebnoj, naprednoj pretrazi, gde ćete moći da definišete operatore kao “manje od“, “je tačno“, “je prazno“, itd. kako biste dobili složeno filtriranje direktno na sajtu

source: You can also download the data in different open formats for your own analyses
sr: Takođe možete da preuzmete podatke u različitim otvorenim formatima za sopstvene analize

source: Don’t know what an API is? The School of Data explains <a href="http://schoolofdata.org/2013/11/18/web-apis-for-non-programmers/">APIs for non-programmers</a> (but you should probably get a developer to help you - <a href="mailto:data@datacentar.io">or ask us for help</a>!)
sr: Ne znate šta je to API? Škola podataka [The School of Data] <a href="http://schoolofdata.org/2013/11/18/web-apis-for-non-programmers/"> objašnjava šta je to API svima koji nisu programeri </a>(ali verovatno će vam trebati programer da vam pomogne - <a href="mailto:data@datacentar.io">ili pitajte nas za pomoć!</a>)

source: On the
sr: Na

source: API page
sr: strani API

source: you can learn about all the parameters you can use for your API calls, and create your custom API
sr: možete da saznate koje sve parametre možete koristiti za vaše API zahteve i možete da napraviti svoj personalizovani API

source: Run the custom API directly on the Data Centar website to see what results it provides you, then tweak to your delight
sr: Pokrenite personalizovani API direktno na sajtu Data Centra da vidite kakve razultate vam to daje, a onda ga izmenite tako da budete zadovoljni

source: Once you’re happy, take the API and plug it into your website, or use it to download raw data on your computer
sr: Kada budete zadovoljni, preuzmite API i postavite na svoj sajt ili ga koristite za preuzimanje sirovih podataka na vaš kompjuter

source: Our entire Search page is powered by our API - so you can create advanced searches, and copy the API link of the search you made
sr: Čitavu našu stranicu za pretragu pokreće naš API - tako da možete kreirate napredne pretrage i kopirate API link vaše pretrage

source: At the bottom of each page, you will find a form where you can choose between four datasets we plan to open.
sr: Na kraju svake strane naći ćete formu gde možete da birate između četiri skupa podataka koje planiramo da otvorimo.

source: Take your pick, and if you want, leave us a comment on how you would use that data. Your feedback is crucial!
sr: Izaberite i ukoliko želite, ostavite nam komentar kako biste koristili te podatke. Povratna informacija od vas je ključna!

source: If you’re not interested in any of the proposed datasets, <a href="mailto:data@datacentar.io">get in touch</a> and propose what you would like us to liberate next
sr: Ukoliko vas ne interesuje nijedan od predloženih skupova podataka, <a href="mailto:data@datacentar.io">javite nam se i predložite</a> šta biste sledeće voleli da oslobodimo

source: The Future
sr: Budućnost

source: <b>We wish to grow into a single online hub for collection, processing and preparation of different datasets of public information at the local, national and regional level.</b>
sr: <b>Želimo da prerastemo u jedan onlajn centar za prikupljanje, obradu i pripremu različitih skupova podataka o javnim informacijama na lokalnom, nacionalnom i regionalnom nivou.</b>

source: <b>After the MVP launch in 2015</b>, Data Centar will expand the number of municipal and other datasets from Serbia, add 2016 budgetary data, and at least two different datasets proposed by the community. The main focus of Data Centar in 2016 will be, in fact, to build a strong community and make sure they are at the forefront of the Data Centar's growth.
sr: <b>Nakon pokretanja MVP-a*** 2015. godine,</b> Data Centar će proširiti broj opštinskih i drugih skupova podataka iz Srbije, dodati podatke o budžetu za 2016. godinu i najmanje dva različita skupa podataka koje predloži zajednica. Fokus Data Centra u 2016. godini zapravo će biti da izgradi čvrstu zajednicu i pobrine se da je ona na čelu razvoja Data Centra.

source: <b>In 2016 and 2017</b>, Data Centar will keep growing organically and responsibly. We will also advocate for increasing the level of governmental openness by influencing the state of open data in Serbia: we wish to see at least two governmental datasets integrated into Data Centar through an open, government-managed API.
sr: <b>U 2016. i 2017. godini </b> Data Centar će nastaviti da raste organski i odgovorno. Takođe ćemo zagovarati povećanje nivoa otvorenosti vlasti uticajem na državu da otvori podatke u Srbiji: želimo da vidimo najmanje dva vladina skupa podataka integrisana u Data Centar kroz otvoren, API kojim upravlja vlada.

source: <br />Data Centar wants to go global: we wish to host datasets from at least two Balkan region countries by end 2017, and incorporate datasets from non-Balkan countries.
sr: <br /> Data Centar želi da se širi globalno: želimo da do kraja 2017. godine budemo sajt-domaćin za skupove podataka za najmanje dve države sa Balkana i da inkorporiramo skupove podataka iz zemalja van Balkana.

source: <b>By the end of 2017</b>, Data Centar aims to be a completely functional open platform that provides broad, easy and full access to multiple datasets of public information from many countries in the region. Our goal is to gain recognition as a one-stop-shop for opening data in a usable and useful way, with a strong and active user community that leads us. This way, Data Centar will be able to influence governments and institutions to increase the quality and provide access to open and useful data.
sr: <b>Do kraja 2017, Data Centar ima za cilj da bude potpuno funkcionalna otvorena platforma koja pruža širok, jednostavan i potpun pristup brojnim skupovima podataka u vezi sa javnim infromacijama iz mnogih država regiona. Naš cilj je da postanemo poznati kao jedinstven servis za otvaranje podatka na upotrebljiv i koristan način, sa snažnom i aktivnom zajednicom korisnika koja nas vodi. Na ovaj način, Data Centar će biti u mogućnosti da utiče na vlade i institucije kako bi povećale kvalitet i omogućile pristup otvorenim i korisnim podacima.

source: Partners
sr: Partneri

source: How?
sr: Kako?

source: Try it!
sr: Probaj!

source: DESCRIPTION: Use this POST request to download data.
sr: OPIS: Koristite ovaj POST zahtev za preuzimanje podataka.

source: POST REQUEST URL: http://datacentar.io/en/api/zbir
sr: URL POST ZAHTEVA: http://datacentar.io/en/api/zbir

source: Parameter
sr: Parametar

source: Type
sr: Vrsta

source: Description
sr: Opis.

source: String.
sr: Stringova.

source: Use this parameter to filter based on the type of data.
sr: Koristite ovaj paramentar za filtriranje na osnovu vrste podataka.

source: List of whole numbers.
sr: Lista celih brojeva.

source: Years we want to download data for.
sr: Godine za koje želimo da preuzmemo podatke.

source: List of strings.
sr: Lista stringova.

source: Municipalities.
sr: Opštine.

source: Economic classification.
sr: Ekonomske klasifikacije.

source: Fillters
sr: Filteri:

source: Number.
sr: Broj.

source: Set the range by setting parameter <strong>veceIliJednako</strong> as the minimal value and parameter <strong>manjeIliJednako</strong> as the maximal value.
sr: Odredite opseg postavljanjem parametara većeIlijednako kao minimalne vrednosti i parametra manjeIliJednako kao maksimalne vrednosti.

source: Filters:
sr: Filteri:

source: Request Body:
sr: Telo od koga se zahteva:

source: Response:
sr: Odgovor:

source: POST REQUEST URL: http://datacentar.io/en/api/ekonomska-klasifikacija
sr: URL POST ZAHTEVA: http://datacentar.io/en/api/ekonomska-klasifikacija

source: INQUIRY PARAMETERS:
sr: PARAMETRI UPITA:

source: Economic classification info for municipalities
sr: Ekonomskih Klasifikacija Info za Opstine

source: Economic classification
sr: Ekonomske klasifikacije.

source: List of Municipalities for Classification Number
sr: Spisak Opština za Klasifikacija Broj

source: POST REQUEST URL: http://datacentar.io/en/api/spisak-opstina-za-klasifikacija-broj
sr: URL POST ZAHTEVA: http://datacentar.io/en/api/spisak-opstina-za-klasifikacija-broj

source: Welcome to Data Centar
sr: Dobro došli u Data Centar

source: Data Centar is an open platform in Serbia that helps you find, liberate and make use of public data.
sr: Data Centar je otvorena platforma u Srbiji koja vam može pomoći da pronađete, oslobodite i koristite javne podatke.

source: We start small to grow responsibly:</b> from municipal budgets in Serbia, to whatever our audience wants us to liberate next. Check the video below to find out more.
sr: Počinjemo od najmanjih kako bismo odgovorno rasli: od opštinskih budžeta u Srbiji pa do bilo čega što naši korisnici budu želeli da otvorimo. Da saznate više, pogledajte video ispod.

source: Show me data about
sr: Prikaži podatke o

source: for
sr: za

source: in
sr: za

source: Generate different search
sr: Nova pretraga

source: Just show me all the data
sr: Prikaži sve podatke

source: We currently have [20] datasets from [10] Serbian municipalities totalling [4,407] line items.
sr: Trenutno imamo [20] skupova podataka iz [10] opština u Srbiji sa ukupno [4,407] stavki.

source: for
sr: za

source: in
sr: za

source: Budget
sr: Budžet

source: Year
sr: Godina
